In [33]:
import pandas as pd
import numpy as np
df= pd.read_csv(r"./drinks.csv")
df['continent'].fillna('NA',inplace=True)

In [34]:
g=df.groupby('continent')

In [35]:
avg=g.mean()

In [36]:
avg['beer_servings']

continent
AF     61.471698
AS     37.045455
EU    193.777778
NA    145.434783
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [37]:
wine=g.describe()['wine_servings']
wine.drop(['25%','50%','75%'],axis=1)

           count        mean        std  min    max
continent
AF          53.0   16.264151  38.846419  0.0  233.0
AS          44.0    9.068182  21.667034  0.0  123.0
EU          45.0  142.222222  97.421738  0.0  370.0
NA          23.0   24.521739  28.266378  1.0  100.0
OC          16.0   35.625000  64.555790  0.0  212.0
SA          12.0   62.416667  88.620189  1.0  221.0

In [38]:
avg.drop('total_litres_of_pure_alcohol',axis=1)

           beer_servings  spirit_servings  wine_servings
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
NA            145.434783       165.739130      24.521739
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

In [39]:
g.median().drop('total_litres_of_pure_alcohol',axis=1)

           beer_servings  spirit_servings  wine_servings
continent
AF                  32.0              3.0            2.0
AS                  17.5             16.0            1.0
EU                 219.0            122.0          128.0
NA                 143.0            137.0           11.0
OC                  52.5             37.0            8.5
SA                 162.5            108.5           12.0

In [40]:
binfo=df['beer_servings'].describe()
binfo=binfo.drop(['25%','50%','75%','std','count'])
winfo=df['wine_servings'].describe()
winfo=winfo.drop(['25%','50%','75%','std','count'])
sinfo=df['spirit_servings'].describe()
sinfo=sinfo.drop(['25%','50%','75%','std','count'])
binfo,winfo,sinfo

(mean    106.160622
 min       0.000000
 max     376.000000
 Name: beer_servings, dtype: float64,
 mean     49.450777
 min       0.000000
 max     370.000000
 Name: wine_servings, dtype: float64,
 mean     80.994819
 min       0.000000
 max     438.000000
 Name: spirit_servings, dtype: float64)

In [41]:
car1=pd.read_csv(r"./cars1.csv")
car2=pd.read_csv(r"./cars2.csv")
car1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick,NaN,NaN,NaN,NaN,NaN
194,22.5,6,232,90,3085,17.6,76,1,amc hornet,NaN,NaN,NaN,NaN,NaN
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette,NaN,NaN,NaN,NaN,NaN
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody,NaN,NaN,NaN,NaN,NaN
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit,NaN,NaN,NaN,NaN,NaN

In [42]:
car1=car1.dropna(axis=1)
car1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick
194,22.5,6,232,90,3085,17.6,76,1,amc hornet
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit

In [43]:
car1.shape,car2.shape

((198, 9), (200, 9))

In [44]:
cf=pd.merge(car1,car2,how="outer")
cf

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97,52,2130,24.6,82,2,vw pickup
395,32.0,4,135,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120,79,2625,18.6,82,1,ford ranger
397,31.0,4,119,82,2720,19.4,82,1,chevy s-10

In [45]:
owner= np.random.randint(15000,75000,398)
cf.assign(owner=owner)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owner
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,43113
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,68533
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,20210
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,35743
4,17.0,8,302,140,3449,10.5,70,1,ford torino,15719
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,55495
394,44.0,4,97,52,2130,24.6,82,2,vw pickup,31591
395,32.0,4,135,84,2295,11.6,82,1,dodge rampage,67597
396,28.0,4,120,79,2625,18.6,82,1,ford ranger,20746
397,31.0,4,119,82,2720,19.4,82,1,chevy s-10,59547

In [46]:
df1=pd.DataFrame({
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name_x': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'last_name_x': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']})
df2=pd.DataFrame({
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name_y': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'last_name_y': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
)
df3=pd.DataFrame({
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
)

In [47]:
df4=pd.merge(df1,df2,on="subject_id")
df4

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

In [48]:
df4=df4.merge(df3)
df4

  subject_id first_name_x last_name_x first_name_y last_name_y  test_id
0          4        Alice        Aoni        Billy      Bonder       61
1          5       Ayoung     Atiches        Brian       Black       16

In [49]:
df4=df4.dropna(axis=0)
df4

  subject_id first_name_x last_name_x first_name_y last_name_y  test_id
0          4        Alice        Aoni        Billy      Bonder       61
1          5       Ayoung     Atiches        Brian       Black       16

In [50]:
df1=pd.merge(df1,df2,how="outer",on='subject_id')
df1

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

In [51]:
animals=['Dog','Cat','Snake','Snake','Dog','Hamster',
         'Cat','Alligator','Cat','Cat','Dog','Hamster','Alligator']
ages=np.random.randint(1,13,size=13)
weights=[40,7,2,3,27,1,5,300,6,8,32,2,400]
lengths=[160,40,70,70,150,20,45,480,60,43,150,30,500]
af=pd.DataFrame({'animal':animals,
                 'age':ages,
                 'weight':weights,
                 'length':lengths
                 }
                )

af

       animal  age  weight  length
0         Dog   10      40     160
1         Cat    1       7      40
2       Snake    7       2      70
3       Snake    6       3      70
4         Dog    6      27     150
5     Hamster    7       1      20
6         Cat    6       5      45
7   Alligator    4     300     480
8         Cat    8       6      60
9         Cat    7       8      43
10        Dog    5      32     150
11    Hamster    6       2      30
12  Alligator    4     400     500

In [52]:
animal_group=af.groupby('animal')

In [53]:
avg=animal_group.mean()
avg['weight']['Cat']

6.5

In [54]:
animal_group.max()['age']['Dog']

10

In [55]:
animal_group.count()

           age  weight  length
animal
Alligator    2       2       2
Cat          4       4       4
Dog          3       3       3
Hamster      2       2       2
Snake        2       2       2

In [56]:
animal_group['length'].sum().median()

188.0